Revit 2027 API
DGNExportOptions.SetExportLineweightTable Method
 Sets the line weight table to use during export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetExportLineweightTable(
	ExportLineweightTable lineweightTable
)
Public Sub SetExportLineweightTable (
	lineweightTable As ExportLineweightTable
)
public:
void SetExportLineweightTable(
	ExportLineweightTable^ lineweightTable
)
member SetExportLineweightTable :
        lineweightTable : ExportLineweightTable -> unit
Parameters
lineweightTable ExportLineweightTable
 The line weight table to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DGNExportOptions Class
Autodesk.Revit.DB Namespace